import person from './person.json' assert { type: 'json' };

console.log(person);

////////////////////////////////////////////////////////////////////////

const person = require('./person.json');

console.log(person);

////////////////////////////////////////////////////////////////////////

fetch('person.json')
  .then(response => response.json())
  .then(person => console.log(person))
  .catch(error => console.error('Error loading JSON:', error));

////////////////////////////////////////////////////////////////////////

//ჯერ მათი გადმოტანაა საჭირო იმისთვის რომ მათზე რაიმე მანიპულაციები მოვახდინოთ

//.json ჩვენ მარტო იმისთვის გვჭირდება რომ შევინახოთ ობიექტები

//მათი მანიპულაციისთვის ჩვენ შეგვიძლია გამოვიყენოთ :

// JSON.stringify() გადაჰყავს მთელი ობიექტი სტრინგში
// JSON.parse() სტრინგიდან გადმოჰყავს ობიექტი

// ეს ორი მეთოდი ერთმანეთის საპირისპირო მეთოდებია

